INSERT INTO company (id, "companyName", address, phone_number, email, dpo) VALUES
(0, 'Default', 'Default', '02-123-4567', 'default@default.com', 'Default')
ON CONFLICT (id) DO NOTHING;

INSERT INTO department (id, "departmentName", company_id) VALUES
(1, 'แผนก Accounting', 0),
(2, 'แผนก Administration', 0),
(3, 'แผนก Financial', 0),
(4, 'แผนก Financial & Accounting', 0),
(5, 'แผนก IT', 0),
(6, 'แผนก Logistics', 0),
(7, 'แผนกการขาย', 0),
(8, 'แผนกการตลาด', 0),
(9, 'แผนกข้อมูลลูกค้า', 0),
(10, 'แผนกคลังสินค้า', 0),
(11, 'แผนกควบคุมคุณภาพ', 0),
(12, 'แผนกควบคุมเอกสาร (DCC)', 0),
(13, 'แผนกจัดซื้อ (ต่างประเทศ)', 0),
(14, 'แผนกจัดซื้อ (ในประเทศ)', 0),
(15, 'แผนกจัดส่งสินค้า', 0),
(16, 'แผนกดูแลและตรวจสอบสิ่งแวดล้อม', 0),
(17, 'แผนกทดสอบ', 0),
(18, 'แผนกเทคโนโลยีสารสนเทศ', 0),
(19, 'แผนกธุรการ', 0),
(20, 'แผนกบรรจุสินค้า', 0),
(21, 'แผนกบริการลูกค้า', 0),
(22, 'แผนกบุคคล', 0),
(23, 'แผนกรักษาความปลอดภัย', 0),
(24, 'แผนกลูกค้าสัมพันธ์', 0),
(25, 'แผนกห้องปฏิบัติการ', 0),
(26, 'แผนกอาคารสถานที่', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO activity (id, activity, company_id) VALUES
(1, 'งาน PM ระบบบำบัดน้ำเสีย', 0),
(2, 'งานการจัดการควบคุมเอกสาร', 0),
(3, 'งานการจัดการด้านปล่องระบายอากาศ', 0),
(4, 'งานขอใช้เอกสารบริษัท', 0),
(5, 'งานขอนำทรัพย์สินออกนอกบริษัท', 0),
(6, 'งานขอเบิกชุดยูนิฟอร์ม', 0),
(7, 'งานขอเบิกวัสดุ/อุปกรณ์สำนักงาน', 0),
(8, 'งานขอใบเสนอราคา', 0),
(9, 'งานขอเปลี่ยนแปลงข้อมูลเจ้าหนี้', 0),
(10, 'งานขอเปลี่ยนแปลงข้อมูลผู้ขาย', 0),
(11, 'งานขอเปลี่ยนแปลงข้อมูลผู้รับจ้าง', 0),
(12, 'งานขอเปลี่ยนแปลงข้อมูลลูกหนี้', 0),
(13, 'งานขอเพิ่มอัตรากำลังคน', 0),
(14, 'งานขอวีซ่าและขอต่ออายุวีซ่า', 0),
(15, 'งานขออนุญาตใช้รถบริษัท', 0),
(16, 'งานขออนุญาตผ่าน-เข้าออกบริษัท', 0),
(17, 'งานขออนุญาตออกนอกบริษัท', 0),
(18, 'งานขายขยะรีไซเคิล', 0),
(19, 'งานขายสินค้า', 0),
(20, 'งานขึ้นทะเบียนอุปกรณ์สารสนเทศ', 0),
(21, 'งานควบคุมคุณภาพ', 0),
(22, 'งานคัดเลือกผู้ขาย', 0),
(23, 'งานคัดเลือกผู้รับจ้าง', 0),
(24, 'งานจองตั๋วเครื่องบิน', 0),
(25, 'งานจัดการและขนส่งขยะมูลฝอย', 0),
(26, 'งานจัดการวัตถุดิบเคลื่อนไหวช้าและไกล้หมดอายุ', 0),
(27, 'งานจัดกิจกรรมส่งเสริมการตลาด', 0),
(28, 'งานจัดเก็บชั่วโมงการทำงานของพนักงาน', 0),
(29, 'งานจัดเก็บสิ่งปฎิกูลและวัสดุเหลือใช้', 0),
(30, 'งานจัดซื้อวัตถุดิบ', 0),
(31, 'งานจัดซื้อวัสดุ-อุปกรณ์สำนักงาน', 0),
(32, 'งานจัดทำ Organization Chart', 0),
(33, 'งานจัดทำเงินเดือน/ค่าตอบแทน', 0),
(34, 'งานจัดทำรายงานขยะ', 0),
(35, 'งานจัดทำและติด Labal tag ชี้บ่ง', 0),
(36, 'งานจัดทำเอกสารรายการโอนเงินต่างประเทศ', 0),
(37, 'งานจ่ายเงินภาษีเงินได้หัก ณ ที่จ่าย', 0),
(38, 'งานจ่ายเงินสดย่อยคืนพนักงาน', 0),
(39, 'งานจ่ายเงินให้ Supplier', 0),
(40, 'งานจ่ายภาษีมูลค่าเพิ่ม', 0),
(41, 'งานแจกจ่ายและเรียกคืนเอกสาร', 0),
(42, 'งานแจ้งข้อมูลพนักงานเข้าระบบประกันสังคม', 0),
(43, 'งานแจ้งข้อมูลพนักงานออกจากระบบประกันสังคม', 0),
(44, 'งานแจ้งประกันอุบัติเหตุกลุ่ม', 0),
(45, 'งานแจ้งเปลี่ยนแปลงข้อมูลพนักงานในระบบประกันสังคม', 0),
(46, 'งานเช็คสต๊อกวัตถุดิบประจำเดือน', 0),
(47, 'งานซ่อมบำรุงรักษาอาคารสถานที่', 0),
(48, 'งานซ่อมปั๊มสูบน้ำ+ปั๊มเติมอากาศ ฯลฯ', 0),
(49, 'งานซ่อมอุปกรณ์สารสนเทศ', 0),
(50, 'งานดำเนินการติดต่อประสานงานกับบริษัทชิปปิ้งเพื่อดำเนินพิธีการศุลกากรขาเข้า', 0),
(51, 'งานดูแลบำรุงรักษาเครื่องจักร เครื่องมือ อุปกรณ์', 0),
(52, 'งานดูแลและควบคุมระบบบำบัดน้ำเสีย', 0),
(53, 'งานตรวจนับสินค้าคงคลัง', 0),
(54, 'งานตรวจรับวัตถุดิบ', 0),
(55, 'งานตรวจสอบข้อมูลกล้องวงจรปิด (CCTV)', 0),
(56, 'งานตรวจสอบระบบความปลอดภัยด้านสารสนเทศ', 0),
(57, 'งานตรวจสอบสภาพวัตถุดิบ', 0),
(58, 'งานติดต่อผู้ส่งมอบเพื่อขอใบเสนอราคา (Enquiry Form) ผ่านทางอีเมล', 0),
(59, 'งานทำจ่ายโอนเงิน ชำระค่าสินค้าและบริการ', 0),
(60, 'งานทำลายเอกสาร', 0),
(61, 'งานเทียบราคาการจัดหาอุปกรณ์สารสนเทศ', 0),
(62, 'งานบันทึกการทำความสะอาด', 0),
(63, 'งานบันทึกข้อมูลคู่ค้า/ตัวแทน', 0),
(64, 'งานบันทึกข้อมูลพนักงาน', 0),
(65, 'งานบันทึกข้อมูลลูกค้า', 0),
(66, 'งานบันทึกตั้งเงินเดือนพนักงาน', 0),
(67, 'งานบันทึกตารางการทำงานแม่บ้าน', 0),
(68, 'งานบันทึกทะเบียนสินทรัพย์ถาวร และตัดจำหน่ายสินทรัพย์ถาวร', 0),
(69, 'งานบันทึกผลการซ่อมบำรุงรักษาอาคารสถานที่', 0),
(70, 'งานบำรุงรักษาอุปกรณ์สารสนเทศ', 0),
(71, 'งานเบิกจ่ายวัตถุดิบ', 0),
(72, 'งานประกันอุบัติเหตุแบบกลุ่มพนักงาน', 0),
(73, 'งานประเมินผู้ขาย', 0),
(74, 'งานประเมินผู้รับจ้าง', 0),
(75, 'งานประสานการติดต่อสรรพากร', 0),
(76, 'งานฝึกอบรมพนักงาน', 0),
(77, 'งานเพิ่มรหัสเจ้าหนี้', 0),
(78, 'งานเพิ่มรหัสผู้ขาย', 0),
(79, 'งานเพิ่มรหัสผู้รับจ้าง', 0),
(80, 'งานเพิ่มรหัสลูกหนี้', 0),
(81, 'งานยื่นรายงาน 90 วัน', 0),
(82, 'งานยืม-คืน', 0),
(83, 'งานร้องขอดำเนินการด้านสารสนเทศ', 0),
(84, 'งานร้องขอดำเนินการสารสนเทศ', 0),
(85, 'งานลาออกของพนักงาน', 0),
(86, 'งานส่งข้อมูลตอบโต้หรือส่งต่อข้อมูลบน Email', 0),
(87, 'งานส่งแบบ ทส.1, ทส.2 (ราชการ)', 0),
(88, 'งานสนับสนุนกิจกรรม Kaizen', 0),
(89, 'งานสรรหาว่าจ้าง', 0),
(90, 'งานสร้างรหัสพนักงาน', 0),
(91, 'งานสัมภาษณ์', 0),
(92, 'งานสำรองข้อมูลกล้องวงจรปิด (CCTV)', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info (id, "info_", company_id) VALUES
(1, 'Line ID', 0),
(2, 'Password', 0),
(3, 'Username', 0),
(4, 'ข้อมุลประวัติอาชญากรรม', 0),
(5, 'ข้อมูลสแกนใบหน้า', 0),
(6, 'ข้อมูลสแกนม่านตา', 0),
(7, 'ข้อมูลสแกนลายนิ้วมือ/ฝ่ามือ', 0),
(8, 'ข้อมูลเสียง', 0),
(9, 'เงินเดือน หรือ รายได้', 0),
(10, 'ชื่อ-นามสกุล', 0),
(11, 'ชื่อบัญชีธนาคาร', 0),
(12, 'ชื่อบัญชีเฟสบุ๊ค', 0),
(13, 'ชื่อบัญชีอินสตราแกรม', 0),
(14, 'ตำแหน่งงาน', 0),
(15, 'ตำแหน่งงานเดิม', 0),
(16, 'ที่อยู่', 0),
(17, 'น้ำหนัก', 0),
(18, 'ผลการตรวจเลือด', 0),
(19, 'ผลการศึกษา', 0),
(20, 'เพศ', 0),
(21, 'ภายถ่าย/ภาพเคลื่อนไหว ที่ได้รับการบันทึก', 0),
(22, 'ภูมิลำเนา', 0),
(23, 'รหัสประจำตัวพนักงาน', 0),
(24, 'รูปถ่ายที่ปรากฎอยู่ในใบสมัครงาน', 0),
(25, 'รูปถ่ายที่ปรากฎอยู่ในสำเนาใบอนุญาตขับขี่รถยนต์/รถจักรยานยนต์', 0),
(26, 'รูปถ่ายที่ปรากฎอยู่ในสำเนาแสดงวุฒิทางการศึกษา', 0),
(27, 'รูปถ่ายที่ปรากฎอยู่ในสำเนาหนังสือเดินทาง', 0),
(28, 'รูปถ่ายที่ปรากฎอยู่บนสำเนาบัตรประตัวประชาชน', 0),
(29, 'ลายพิมพ์นิ้วมือ', 0),
(30, 'ลายมื่อชื่อ / ลายเซ็น', 0),
(31, 'เลขที่กรมธรรม์', 0),
(32, 'เลขที่บัญชีธนาคาร', 0),
(33, 'เลขที่บัตรเครดิต', 0),
(34, 'เลขที่หนังสือเดินทาง', 0),
(35, 'เลขประจำตัวใบขับขี่รถยนต์/รถจักรยานยนต์', 0),
(36, 'เลขประจำตัวประชาชน', 0),
(37, 'เลขรหัสประจำบ้าน', 0),
(38, 'วัน เดือน ปีเกิด', 0),
(39, 'วัน เดือน ปีที่ผ่านการฝึกอบรม', 0),
(40, 'วัน เดือน ปีที่ผ่านงาน', 0),
(41, 'วันที่เข้ารับการศึกษา', 0),
(42, 'วันที่สำเร็จการศึกษา', 0),
(43, 'วุฒิการศึกษา', 0),
(44, 'ศาสนา', 0),
(45, 'สถานที่เกิด', 0),
(46, 'สถานที่เข้ารับการฝึกอบรม', 0),
(47, 'สถานที่ทำงาน', 0),
(48, 'สถานที่ทำงานล่าสุด หรือ สถานที่ทำงานที่ผ่านมา', 0),
(49, 'สถานภาพการสมรส', 0),
(50, 'สถานภาพทางการทหาร', 0),
(51, 'สถานศึกษา', 0),
(52, 'ส่วนสูง', 0),
(53, 'สัญชาติ', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_owner (id, "owner_", company_id) VALUES
(1, 'กรรมการ', 0),
(2, 'คู่ค้า/ตัวแทน', 0),
(3, 'คู่สมรส', 0),
(4, 'คู่สัญญา', 0),
(5, 'บิดา', 0),
(6, 'บุคคลอ้างอิง', 0),
(7, 'บุตร', 0),
(8, 'ผู้บริหาร', 0),
(9, 'ผู้สมัครงาน', 0),
(10, 'ผู้อำนวยการ', 0),
(11, 'พนักงาน', 0),
(12, 'พี่-น้อง', 0),
(13, 'มารดา', 0),
(14, 'ลูกค้า', 0),
(15, 'วิทยากร', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_from (id, "from_", company_id) VALUES
(1, 'ข้อมูลจากแหล่งอื่น', 0),
(2, 'เจ้าของข้อมูลโดยตรง', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_format (id, "format_", company_id) VALUES
(1, 'ข้อมูลทั่วไป (General Data)', 0),
(2, 'ข้อมูลอ่อนไหว (Sensitive Data)', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_type (id, "type_", company_id) VALUES
(1, 'ข้อมูลเกี่ยวกับกรมธรรม์ประกันภัย', 0),
(2, 'ข้อมูลเกี่ยวกับการเข้าใช้งานเว็บไซต์', 0),
(3, 'ข้อมูลเกี่ยวกับการเข้าใช้งานหรือใช้บริการระบบ, เครือข่ายอินเตอร์เน็ต หรือ แอปพลิเคชั่น', 0),
(4, 'ข้อมูลเกี่ยวกับการเงิน และความสัมพันธ์ทางธุรกิจ', 0),
(5, 'ข้อมูลเกี่ยวกับการตลาดและการวิจัยทางการตลาด', 0),
(6, 'ข้อมูลเกี่ยวกับการติดต่อ', 0),
(7, 'ข้อมูลเกี่ยวกับการทำงาน', 0),
(8, 'ข้อมูลเกี่ยวกับการระบุตัวตน และการยืนยันตัวตน', 0),
(9, 'ข้อมูลเกี่ยวกับการศึกษา', 0),
(10, 'ข้อมูลเกี่ยวกับการสื่อสารและตอบโต้', 0),
(11, 'ข้อมูลรายละเอียดส่วนบุคคล', 0),
(12, 'ข้อมูลส่วนบุคคลแบบอ่อนไหว', 0),
(13, 'ข้อมูลส่วนบุคคลแบบอ่อนไหวด้านสุขภาพ', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_objective (id, "objective_", company_id) VALUES
(1, 'เพื่อใช้แจ้งเข้าพนักงานทำประกันอุบัติเหตุส่วนบุคคล', 0),
(2, 'เพื่อใช้แจ้งเปลี่ยนแปลงข้อมูลพนักงานใบระบบประกันสังคม', 0),
(3, 'เพื่อใช้แจ้งออกพนักงานทำประกันอุบัติเหตุส่วนบุคคล', 0),
(4, 'เพื่อใช้ทำ Credit Note, Debit Note ในงานขายสินค้า', 0),
(5, 'เพื่อใช้บันทึกข้อมูลการสมัครงานของผู้สมัครงาน', 0),
(6, 'เพื่อใช้บันทึกข้อมูลการสัมภาษณ์', 0),
(7, 'เพื่อใช้บันทึกข้อมูลบุคคลอ้างอิงของผู้สมัครงาน', 0),
(8, 'เพื่อใช้ประกอบเอกสารประเมินผลผ่านทดลองงาน', 0),
(9, 'เพื่อใช้เป็นหลักฐานในการรับเงินจากการเปิด Tax Invoice สำหรับงานขายสินค้า', 0),
(10, 'เพื่อใช้เปิด Tax Invoice สำหรับงานขายสินค้า', 0),
(11, 'เพื่อใช้ยื่นภาษีเงินได้หัก ณ ที่จ่าย', 0),
(12, 'เพื่อใช้ยื่นภาษีมูลค่าเพิ่ม', 0),
(13, 'เพื่อใช้ร้องขอเพิ่มอัตรากำลังคน', 0),
(14, 'เพื่อใช้ร้องขอและบันทึกข้อมูลการลาออกจากงานของพนักงาน', 0),
(15, 'เพื่อใช้สำหรับการสมัครงาน', 0),
(16, 'เพื่อใช้สำหรับบันทึกการตั้งเงินเดือน/ค่าตอบแทนพนักงาน', 0),
(17, 'เพื่อใช้สำหรับประกอบเอกสารการสมัครงาน', 0),
(18, 'เพื่อใช้อนุมัติการลาออกจากงานของพนักงาน', 0),
(19, 'เพื่อใช้อนุมัติการสมัครงาน', 0),
(20, 'เพื่อบันทึกการตัดจำหน่ายสินทรัพย์ถาวร', 0),
(21, 'เพื่อบันทึกทะเบียนสินทรัพย์ถาวร', 0),
(22, 'เพื่อบันทึกเป็นข้อมูลอ้างอิงการตรวจสอบเพื่อขอคืนภาษี', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_lawbase (id, "lawBase_", company_id) VALUES
(1, 'ฐานการจัดทำเอกสารประวัติศาสตร์หรือจดหมายเหตุ เพื่อประโยชน์สาธารณะ (ข้อมูลทั่วไป)', 0),
(2, 'ฐานการจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมาย (ข้อมูลทั่วไป)', 0),
(3, 'ฐานการดำเนินกิจกรรมโดยชอบด้วยกฎหมายของ มูลนิธิ สมาคม หรือองค์กรที่ไม่แสวงหากำไร (ข้อมูลอ่อนไหว)', 0),
(4, 'ฐานการปฏิบัติตามกฎหมาย (ข้อมูลทั่วไป)', 0),
(5, 'ฐานการปฏิบัติตามสัญญา (ข้อมูลทั่วไป)', 0),
(6, 'ฐานการปฏิบัติหน้าที่ในการดำเนินภารกิจเพื่อประโยชน์สาธารณะ (ข้อมูลทั่วไป)', 0),
(7, 'ฐานการป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของบุคคล (ข้อมูลทั่วไป)', 0),
(8, 'ฐานการป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของบุคคล (ข้อมูลอ่อนไหว)', 0),
(9, 'ฐานความยินยอม (ข้อมูลทั่วไป, ข้อมูลอ่อนไหว)', 0),
(10, 'ฐานเป็นการจำเป็นเพื่อการก่อตั้งสิทธิเรียกร้องตามกฎหมาย (ข้อมูลอ่อนไหว)', 0),
(11, 'ฐานเป็นการจำเป็นเพื่อปฏิบัติตามกฎหมาย เกี่ยวกับการคุ้มครองแรงงาน การประกันสังคม หลักประกันสุขภาพ สวัสดิการเกี่ยวกับการรักษาพยาบาล ฯลฯ (ข้อมูลอ่อนไหว)', 0),
(12, 'ฐานเป็นการจำเป็นเพื่อปฏิบัติตามกฎหมาย เกี่ยวกับการศึกษาวิจัยทางวิทยาศาสตร์ ประวัติศาสตร์ สถิติ หรือประโยชน์สาธารณะอื่น (ข้อมูลอ่อนไหว)', 0),
(13, 'ฐานเป็นการจำเป็นเพื่อปฏิบัติตามกฎหมาย เกี่ยวกับประโยชน์สาธารณะด้านการสาธารณสุข (ข้อมูลอ่อนไหว)', 0),
(14, 'ฐานเป็นการจำเป็นเพื่อปฏิบัติตามกฎหมาย เกี่ยวกับประโยชน์สาธารณะที่สำคัญ (ข้อมูลอ่อนไหว)', 0),
(15, 'ฐานเป็นการจำเป็นเพื่อปฏิบัติตามกฎหมาย เกี่ยวกับเวชศาสตร์ป้องกันหรือาชีวเวชศาสตร์ (ข้อมูลอ่อนไหว)', 0),
(16, 'ฐานเป็นข้อมูลที่เปิดเผยต่อสาธารณะด้วยความยินยอมโดยชัดแจ้งของเจ้าของข้อมูลส่วนบุคคล (ข้อมูลอ่อนไหว)', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_stored_period (id, "period_", company_id) VALUES
(1, '1 ปี นับจากวันยื่นใบสมัตรงาน กรณีไม่ผ่านขั้นต้อนการสัมภาษณ์งาน', 0),
(2, '10 ปี นับจากวันจัดทำเอกสาร', 0),
(3, '10 ปี นับจากวันพ้นสภาพพนักงาน', 0),
(4, '2 ปี นับจากวันจัดทำเอกสาร', 0),
(5, '3 เดือน นับจากวันยื่นใบสมัครงาน กรณีไม่ผ่านเกณฑ์ขั้นตอนการสรรหา', 0),
(6, '3 ปี นับจากวันจัดทำเอกสาร', 0),
(7, '5 ปี นับจากวันจัดทำเอกสาร', 0),
(8, '7 ปี นับจากวันจัดทำเอกสาร', 0),
(9, 'ยังไม่ได้กำหนดระยะเวลาจัดเก็บ สำหรับข้อมูลในระบบประมวลผล', 0),
(10, 'ยังไม่ได้กำหนดระยะเวลาในการจัดเก็บเอกสาร', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_placed (id, "placed_", company_id) VALUES
(1, 'เก็บข้อมูลไว้ในระบบ/โปรแกรมประมวลผล', 0),
(2, 'จัดเก็บเอกสารไว้ในกล่องบรรจุเอกสาร และเก็บไว้ที่ห้องเก็บเอกสาร', 0),
(3, 'ไฟล์ข้อมูลใน โฟล์เดอร์ข้อมูลผู้สมัครงาน และ โฟล์เดอร์พนักงาน ที่บันทึกในเซอร์เวอร์ของบริษัทฯ', 0),
(4, 'ระบบ e-Service ในเว็บไซต์กรมสรรพากร', 0),
(5, 'ระบบ e-Service ในเว็บไซต์สำนักงานประกันสังคม', 0),
(6, 'ใส่แฟ้มเก็บไว้ในตู้เก็บเอกสารของฝ่ายบุคคล มีกุญแจล๊อค', 0),
(7, 'อีเมล (E-mail) ของพนักงาน', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_allowed_ps (id, "allowed_ps_", company_id) VALUES
(1, 'เจ้าหน้าที่รับสมัครและคัดเลือกบุคคลากร', 0),
(2, 'ผู้จัดการแผนก ที่ประสงค์เพิ่มอัตรากำลัง', 0),
(3, 'ผู้จัดการฝ่ายฯ', 0),
(4, 'พนักงานแผนก', 0),
(5, 'หัวหน้าแผนก', 0),
(6, 'หัวหน้าฝ่าย', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_allowed_ps_condition (id, "allowed_ps_condition_", company_id) VALUES
(1, 'เจ้าหน้าที่รับสมัครและคัดเลือกบุคลากรที่ได้รับการแต่งตั้ง และมอบหมายหน้าที่จากผู้จัดการฝ่ายบุคคล', 0),
(2, 'ผู้จัดการฝ่าย และ/หรือผู้จัดการแผนก ที่ได้ยี่นความประสงค์เพิ่มอัตรากำลัง สามารถเข้าถึงข้อมูลเฉพาะคราว ที่ตนได้ยื่นความต้องการไว้เท่านั้น', 0),
(3, 'ผู้จัดการฝ่ายบุคคล เข้าถึงข้อมูลได้ตามหน้าที่ที่กำหนดไว้ในเอกสารอันเป็นวิธีปฏิบัติงานหรือคู่มืออำนาจดำเนินการ (Authorization Code) ที่บริษัทกำหนดไว้', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_access (id, "access_", company_id) VALUES
(1, 'ข้อมูลที่เก็บไว้ในระบบ/โปรแกรมประมวลผล จะเข้าถึงได้ด้วยการใช้ Username / Password ประจำตัวพนักงานแต่ละคน', 0),
(2, 'เอกสาร เก็บใส่ตู้เก็บเอกสารที่ห้องผู้จัดการฝ่ายฯ มีการล๊อคกุญแจ', 0),
(3, 'เอกสารที่จัดเก็บไว้ในโฟลเดอร์/ไฟล์เอกสาร จะเข้าถึงได้ด้วย Usename/Password ของผู้ได้รับการอนุมัติโดยผู้มีอำนาจ', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_access_condition (id, "access_condition_", company_id) VALUES
(1, 'ผู้จัดการฝ่ายฯ เป็นผู้รักษากุญแจ และอนุมัติการใช้งานเอกสาร', 0),
(2, 'เข้าถึงข้อมูลด้วย Usename/Password ของเจ้าหน้าที่รับสมัครและคัดเลือกบุคลากร ซึ่งมีหน้าที่ในการบันทึกและส่งต่อข้อมูลให้ผู้ที่เกี่ยวข้องเท่านั้น ห้ามทำการเปลี่ยนแปลง แก้ไข ลบ ทำลาย สำรองข้อมูล หรือกระทำการอย่างใดๆ โดยไม่ได้รับอนุญาตเป็นหนังสือจากผู้จัดการฝ่าย โดยเด็ดขาด', 0),
(3, 'เข้าถึงข้อมูลด้วย Usename/Password ของผู้จัดการฝ่าย และ/หรือ ผู้จัดการแผนก ที่ยื่นความประสงค์ขอเพิ่มอัตรากำลัง ซึ่งสามารถเข้าถึงข้อมูลได้ เพื่อดูข้อมูลเพียงอย่างเดียวเท่านั้น ห้ามทำการเปลี่ยนแปลง แก้ไข ลบ ทำลาย สำรอง หรือส่งต่อข้อมูล โดยเด็ดขาด', 0),
(4, 'เข้าถึงข้อมูลด้วย Usename/Password ของผู้จัดการฝ่ายบุคคล ซึ่งสามารถเข้าถึงข้อมูล เพื่อดูรายละเอียด และส่งต่อข้อมูลให้ผู้เกี่ยวข้องได้ รวมถึงมีอำนาจในการแก้ไข หรือเปลี่ยนแปลงข้อมูลได้ เมื่อได้รับความยินยอมเป็นหนังสือจากเจ้าของข้อมูลส่วนบุคคล หรือลบข้อมูลได้เมื่อถึงกำหนดระยะเวลาในการจัดเก็บ เท่านั้น', 0),
(5, 'พนักงานผู้รับผิดชอบ สามารถเข้าถึงเพื่อการใช้ข้อมูล แต่ไม่สามารถแก้ไขข้อมูลได้', 0),
(6, 'พนักงานผู้รับผิดชอบ สามารถเข้าถึงเพื่อการใช้ข้อมูล และสามารถแก้ไขข้อมูลได้', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_ps_usedbyrole_inside (id, "use_by_role_", company_id) VALUES
(1, 'กรณีที่ผู้สมัคร ผ่านขั้นตอนการสัมภาษณ์และได้รับคัดเลือกบรรจุเข้าเป็นพนักงาน ข้อมูลการสมัครงานจะถูกส่งให้ เจ้าหน้าที่ฝ่ายบุคคล เจ้าหน้าที่ฝ่ายบัญชี เจ้าหน้าที่ฝ่าย IT', 0),
(2, 'กรณีที่ผู้สมัคร ผ่านเข้าสู่ขั้นตอนการสัมภาษณ์งาน ข้อมูลจะถูกเปิดเผยให้แก่บุคคลภายในองค์กร โดยให้ผู้จัดการฝ่าย หรือผู้จัดการแผนก ที่ได้รับการแต่งตั้งเป็นกรรมการสัมภาษณ์งาน จำนวน 3 ท่าน และข้อมูลจะถูกใช้เฉพาะในวันสัมภาษณ์งานเท่านั้น', 0),
(3, 'กรณีที่ผู้สมัครไม่เกณฑ์ขั้นตอนการสรรหา (รอบแรก) จะไม่มีการส่งต่อข้อมูลไปสู่หน่วยงานอื่นภายนอกแผนก', 0),
(4, 'พนักงานฝ่าย', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_ps_sendto_outside (id, "sendto_", company_id) VALUES
(1, 'กรมศุลกากร', 0),
(2, 'กรมสรรพากร', 0),
(3, 'คู่ค้า', 0),
(4, 'เจ้าหนี้', 0),
(5, 'ตัวแทน', 0),
(6, 'ผู้ตรวจสอบบัญชี', 0),
(7, 'ลูกค้า', 0),
(8, 'ลูกหนี้', 0),
(9, 'สถานพยาบาล เพื่อตรวจสุขภาพพนักงานก่อนเริ่มงาน', 0),
(10, 'สถานพยาบาล เพื่อตรวจสุขภาพพนักงานประจำปี', 0),
(11, 'สำนักงานตำรวจแห่งชาติ เพื่อตรวจสอบข้อมูลประวัติอาชญากรรม', 0),
(12, 'สำนักงานประกันสังคม', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_ps_destroying (id, "destroying_", company_id) VALUES
(1, 'ข้อมูลที่อยู่ใน โฟลเดอร์ที่บันทึกในเซอร์เวอร์ของบริษัท จะทำการลบข้อมูล (Delete) ออกทั้งหมด', 0),
(2, 'ข้อมูลที่อยู่ใน โฟลเดอร์ที่บันทึกในระบบคราวน์ของบริษัท จะทำการลบข้อมูล (Delete) ออกทั้งหมด', 0),
(3, 'ข้อมูลที่อยู่ในรูปแบบเอกสาร ส่งให้บริษัทรับจ้างทำลายเอกสาร (เอกชน) เป็นผู้นำเอกสารไปทำลายด้วยเครื่องกำจัดเอกสาร', 0),
(4, 'ข้อมูลในกล่องจดหมาย ของ อีเมลเจ้าหน้าที่ที่รับผิดชอบ จะมีการตั้งค่ากำหนดเวลาในการลบกล่องจดหมายไว้ และมีการตรวจทานกล่องจดหมายในอีเมลทุกๆ 3 เดือน เพื่อทำการลบข้อมูล', 0),
(5, 'ยังไม่ได้กำหนด', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO info_ps_destroyer (id, "destroyer_", company_id) VALUES
(1, 'ผู้จัดการฝ่าย', 0),
(2, 'ยังไม่ได้กำหนด', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO m_organization (id, "organization", company_id) VALUES
(1, 'กำหนดกฎระเบียบ ข้อบังคับ ห้ามพนักงานทุกคน ใช้เครื่องคอมพิวเตอร์ โน๊ตบุ๊ค หรือโทรศัพท์ส่วนตัวติดต่องานของบริษัทฯ ทาง E-mail หรือส่งต่อข้อมูลโดยวิธีการอย่างใดๆ โดยเด็ดขาด', 0),
(2, 'กำหนดนโยบาย ระเบียบ วิธีปฏิบัติงาน หรือ คำสั่ง เกี่ยวกับการเก็บรักษาเอกสาร ให้ชัดเจน โดยกำหนดให้เอกสารทุกประเภท ต้องจัดเก็บใส่ตู้เอกสารที่มีการล๊อคกุญแจ และให้ผู้จัดการฝ่าย เป็นผู้เก็บรักษากุญแจเท่านั้น', 0),
(3, 'กำหนดนโยบาย ระเบียบ วิธีปฏิบัติงาน หรือ คำสั่ง เกี่ยวกับการส่งงานของบริษัทฯ ทาง E-mail โดยกำหนดให้พนักงานทุกคนต้องใช้การติดต่อสื่อสารทาง E-mail ด้วยเครื่องคอมพิวเตอร์ประจำสำนักงานเท่านั้น', 0),
(4, 'กำหนดนโยบาย ระเบียบ วิธีปฏิบัติงาน หรือ คำสั่ง เกี่ยวกับหน้าที่ในกิจกรรมงานของพนักงานให้ชัดเจน ซึ่งอาจรวมไปถึง ข้อห้าม และบทลงโทษทางวินัย หากพนักงานมิได้ปฏิบัติตาม', 0),
(5, 'กำหนดนโยบาย ระเบียบ วิธีปฏิบัติงาน หรือ คำสั่ง ห้ามนำเอกสารที่มีข้อมูลส่วนบุคคลมาใช้เป็นกระดาษ Reuse โดยเด็ดขาด', 0),
(6, 'กำหนดนโยบาย ระเบียบ วิธีปฏิบัติงาน หรือ คำสั่ง ห้ามพนักงานทุกคน ใช้เครื่องคอมพิวเตอร์ โน๊ตบุ๊ค หรือโทรศัพท์ส่วนตัวติดต่องานของบริษัทฯ ทาง E-mail โดยเด็ดขาด', 0),
(7, 'กำหนดนโยบาย ระเบียบ วิธีปฏิบัติงาน หรือ คำสั่ง ห้ามพนักงานหรือผู้ไม่มีส่วนเกี่ยวข้อง คัดลอกหรือถ่ายโอนข้อมูลโดยไม่ได้รับอนุญาต รวมถึงกำหนดบทลงโทษหากพบการกระทำผิด', 0),
(8, 'กำหนดนโยบายของบริษัท ว่าด้วยระเบียบ วิธีปฏิบัติ ในการทำสัญญาว่าจ้างบุคคลหรือนิติบุคคลภายนอกองค์กร จะต้องพิจารณาหรือระบุเงื่อนไขต่างๆ ไว้ในสัญญา โดยคู่สัญญาจะต้องมีการกำหนดมาตรการรักษาความมั่นคงปลอดภัยของข้อมูล เทียบเท่า  หรือดียิ่งกว่าบริษัทเรา และพร้อมให้บริษัททำการตรวจสอบได้ตามระยะเวลาที่สมควร', 0),
(9, 'กำหนดนโยบายของบริษัท ว่าด้วยระเบียบ วิธีปฏิบัติ ในการทำสัญญาว่าจ้างบุคคลหรือนิติบุคคลภายนอกองค์กร จะต้องพิจารณาหรือระบุเงื่อนไขต่างๆ ไว้ในสัญญา โดยคู่สัญญาจะต้องมีนโยบายในการบริหารงานเกี่ยวก้บข้อมูลส่วนบุคคลที่ชัดเจน และมีกระบวนการปฏิบัติงานภายในองค์เกี่ยวกับเรื่องข้อมูลส่วนบุคคลที่เทียบเท่า หรือดียิ่งกว่าบริษัท', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO m_technical (id, "technical", company_id) VALUES
(1, 'กำหนดรหัสผ่านด้วย Username/Password ของการเข้าถึง Email และการเข้าถึงเครื่องที่ใช้งาน ให้มีความแตกต่างกันของพนักงานแต่ละคน', 0),
(2, 'จัดหาโปรแกรมการป้องกันการส่งข้อมูลทาง E-mail โดยให้ข้อมูลที่ไปถึงผู้รับ มีการลงรหัสการเข้างานใช้ไว้ เมื่อผู้รับได้รับ E-mail ต้องมีการส่งจดหมายตอบกลับเพื่อขอรหัสผ่าน ทั้งนี้เพื่อเป็นการยืนยันการรับและส่งข้อมูล ป้องกันมิให้พนักงานส่งข้อมูลผิดพลาด', 0),
(3, 'จำกัดสิทธิการเข้าถึงข้อมูลทั้งหมดทันที เมื่อพนักงานพ้นสภาพการจ้างงาน', 0),
(4, 'มีการ Back UP ข้อมูลในแหล่งจัดเก็บภายนอกที่มีระบบรักษาความปลอดภัย และกำหนดผู้เข้าถึงข้อมูลไว้เฉพาะเจ้าหน้าที่ดูแลระบบเท่านั้น เพื่อป้องกันการสุญหายของข้อมูล หากพนักงานเผลอลบข้อมูลทิ้งโดยไม่ได้ตั้งใจ', 0),
(5, 'มีการใช้โปรแกรมการตั้งค่าการปิดกั้น (Lock) อุปกรณ์คอมพิวเตอร์ หรือข้อมูลที่อยู่ในเซิร์ฟเวอร์ไว้เสมอ เพื่อกันไม่ให้พนักงานหรือบุคคลที่ไม่มีส่วนเกี่ยวข้องคัดลอกหรือถ่ายโอนข้อมูลไปใช้โดยมิชอบ', 0),
(6, 'มีการติดตั้งกล้องวงจรปิดบริเวณตู้เก็บเอกสาร เพื่อบันทึกภาพนิ่ง, ภาพเคลื่อนไหว และเสียงไว้ตรวจสอบในภายหลัง หากเกิดกรณีที่ข้อมูลถูกละเมิดหรือรั่วไหล', 0),
(7, 'มีการทดสอบระบบการป้องกันข้อมูลที่จัดเก็บในเซิร์ฟเวอร์ทุกๆ 6 เดือน', 0),
(8, 'มีการเปลี่ยน Usename/Password ทุกๆ 1-3 เดือน', 0),
(9, 'ให้เจ้าหน้าที่ IT ติดตั้งระบบควบคุมการใช้งานเครื่องคอมพิวเตอร์ของพนักงานทุกคนภายในองค์กร โดยมีการกำหนดเวลา Log Out ออกจากระบบทันที เมื่อคอมพิวเตอร์ของพนักงานไม่การการปฏิบัติบัติงานภายในเวลาที่กำหนด (หากคอมพิวเตอร์ไม่มีการใช้งานภายใน 5 นาที คอมพิวเตอร์จะทำการ Log Out โดยอัตโนมัติ และพนักงานจะต้องใส่รหัส Usename/Password ใหม่ เพื่อเข้าปฏิบัติงานต่อไป) เพื่อป้องกันไม่ให้บุคคลผู้ไม่มีส่วนเกี่ยวข้องสามารถเข้าถึงข้อมูลได้โดยไม่มีสิทธิ', 0)
ON CONFLICT (id) DO NOTHING;

INSERT INTO m_physical (id, "physical", company_id) VALUES
(1, 'กรณีที่ต้องมีการขอยินยอมจากเจ้าของข้อมูลจากแหล่งอื่น เจ้าหน้าที่รับสมัครและคัดเลือกบุคลากร จะต้องแนบเอกสารขอความยินยอม และตรวจทานการเซ็นให้ความยินยอมโดยเจ้าของข้อมูลให้ถูกต้องทุกครั้ง ก่อนทำการจัดเก็บ', 0),
(2, 'การส่งเอกสารทางไปรษณีย์ จะต้องส่งด้วยวิธีการลงทะเบียนเท่านั้น ห้ามใช้วิธีติดแสดมป์ แล้วส่งที่ตู้ไปรษณีย์เด็ดขาด เพื่อการสูญหายของเอกสาร', 0),
(3, 'กำหนดให้ผู้จัดการฝ่ายฯ เป็นผู้เก็บรักษากุญแจตู้เก็บเอกสาร และเป็นผู้อนุมัติในการเก็บ การใช้ หรือการส่งต่อเอกสาร เพื่อควบคุมมิให้ข้อมูลส่วนบุคคลที่อยู่ในเอกสารถูกนำไปใช้ หรือเปิดเผยโดยบุคคลที่ไม่เกียวข้อง', 0),
(4, 'กำหนดให้มีการลงบันทึกการรับ-ส่งเอกสารใน Log Book เพื่อให้ทราบว่าเอกสารใด ถูกรับหรือส่งโดยใคร เมื่อไหร่ สำหรับการตรวจสอบในภายหลัง หากมีการสูญหายของเอกสารเกิดขึ้น', 0),
(5, 'จัดกิจกรรมเพื่อคอยกระตุ้น หรือเน้นย้ำ ให้พนักงานปฏิบัติตามหน้าที่ของตนโดยเคร่งครัด และต้องหมั่นตระหนักถึงความสำคัญ ในการรวบรวม การจัดเก็บ การใช้  การเปิดเผย หรือการส่งต่อข้อมูลส่วนบุคคลในกิจกรรมงานของตนอยู่เสมอ', 0),
(6, 'ต้องนำเอกสารใส่ซองทึบ ปิดผนึกให้แน่นหนา ก่อนถึงมือผู้รับปลายทาง เพื่อกันไม่ให้บุคคลที่ไม่เกี่ยวข้องสามารถนำข้อมูลส่วนบุคคลในเอกสารไปใช้โดยทุจริตได้', 0),
(7, 'ทบทวน และเน้นย้ำกับพนักงาน ให้มีการตรวจทานข้อมูลต่างๆ และ E-mail ของผู้รับปลายทางให้ถูกต้องก่อนการส่งทุกครั้ง เป็นกิจวัตร เพื่อตรวจทานไม่ให้เกิดความผิดพลาดในการส่งต่อข้อมูล', 0),
(8, 'เน้นย้ำเจ้าหน้าที่รับสมัครและคัดเลือกบุคลากร ให้ทำการลบข้อมูลอ่อนไหวที่ไม่ต้องการใช้ เช่น ศาสนา ออกจากรายละเอียดข้อมูลที่ปรากฎอยู่ในเอกสาร โดยการทำทึบข้อมูล หรือให้เจ้าของข้อมูลทำการปิดทึบข้อมูลนั้น ก่อนรับเอกสารทุกครั้ง', 0),
(9, 'เน้นย้ำให้พนักงานตรวจตราเอกสารให้เรียบร้อยก่อนนำกระดาษมาใช้เป็นกระดาษ Reuse โดยห้ามนำกระดาษที่มีข้อมูลส่วนบุคคลมาใช้เป็นกระดาษ Reuse โดยเด็ดขาด และมีการจัดทำป้ายประกาศ/เตือน ติดไว้ที่เครื่องถ่ายเอกสารหรือเครื่องปริ้นท์เตอร์', 0),
(10, 'ในการติดต่องานของบริษัทฯ ให้พนักใช้ Email ที่อยู่ในเครื่องคอมพิวเตอร์ฯ ประจำสำนักงานเท่านั้น', 0),
(11, 'หากต้องใช้บริการของผู้รับ-ส่งเอกสารจากผู้ให้บริการภายนอก จะต้องใช้บริการกับผู้ให้บริการที่มีมาตรการในการรับ-ส่งเอกสารที่เชื่อถือได้เท่านั้น โดยคำนึงถึงวิธีการจัดส่ง การเก็บรักษาเอกสารระหว่างการจัดส่ง และการรักษาความลับของเอกสาร เป็นสำคัญ', 0),
(12, 'ห้ามพนักงานติด Username/Password ไว้ที่โต๊ะทำงาน หรืออุปกรณ์สำนักงาน โดยเด็ดขาด', 0),
(13, 'ห้ามพนักงานนำอุปกรณ์บันทึกข้อมูล เช่น แฟรชไดร์ฟ อาร์ดดิส สายโอน/ถ่ายข้อมูล เข้ามาในบริษัทโดยเด็ดขาด', 0)
ON CONFLICT (id) DO NOTHING;